-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jan 27, 2026 at 10:06 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `employees_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `accounts`
--

CREATE TABLE `accounts` (
  `id` int(10) UNSIGNED NOT NULL,
  `employee_id` varchar(50) NOT NULL,
  `teams_account` varchar(255) DEFAULT NULL,
  `attendance_platform` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `stage` varchar(50) NOT NULL DEFAULT 'ثانوي'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `accounts`
--

INSERT INTO `accounts` (`id`, `employee_id`, `teams_account`, `attendance_platform`, `created_at`, `stage`) VALUES
(1, '27781808312', 'Mmmmmmmmmmm', 'Mmmmmm', '2025-10-17 10:43:24', 'ثانوي'),
(2, '28681811552', 'ahmed-shokry@alforqanschoolsonmicrosoft.com', 'a.hegazi2911', '2025-10-17 10:43:24', 'ثانوي'),
(3, '28081809742', 'M.abdelkader0706', 'M.abdelkader0706', '2025-10-17 10:43:24', 'ثانوي'),
(4, '28681804063', 'tech70705457@alforqanschools.onmicrosoft.com', 'Ezzat', '2025-10-17 10:43:24', 'ثانوي'),
(5, '28140002129', '0', 'Ahmad.awad', '2025-10-17 10:43:24', 'ثانوي'),
(6, '28381811890', 'tamer_yosef37@alforqanschools.onmicrosoft.com', 't.omar1101 12345', '2025-10-17 10:43:24', 'ثانوي'),
(7, '27581806159', 'tech8@alforqanschools.onmicrosoft.com', 'A.kobali0401', '2025-10-17 10:43:24', 'ثانوي'),
(8, '27581808296', 'tech079@alforqanschools.onmicrosoft.com', 'w.bayoumi0101', '2025-10-17 10:43:24', 'ثانوي'),
(9, '28381808054', 'tech063', 'w.abdelrady2709', '2025-10-17 10:43:24', 'ثانوي'),
(10, '27781803845', 'mahmoud-mohd@alforganschools.onmicrosoft.com', 'm.elsayed0804', '2025-10-17 10:43:24', 'ثانوي'),
(11, '28981807289', 'Tech034@alforqanschools.microsoft.com', 'm.hawwas0107', '2025-10-17 10:43:24', 'ثانوي'),
(12, '28081810347', 'Mohd_azez@alforqanschools.onmicrosoft.com', 'Mohameddbio', '2025-10-17 10:43:24', 'ثانوي'),
(13, '27581806160', 'Tech24@alforqanschools.onmicrosoft.com', 'm.altayfa1603', '2025-10-17 10:43:24', 'ثانوي'),
(14, '27781804856', 'tamer.abdou@animationiconix.com', 'tatasasa2000', '2025-10-17 10:43:24', 'ثانوي'),
(15, '27140000444', 'tech055@alforqanschool.onmicrosoft.com', 'a.amr3103', '2025-10-17 10:43:24', 'ثانوي'),
(16, '28379202237', 'tech_hosny@alforqanschools.onmicrosoft.com', 'amrassem536@gmail.com', '2025-10-17 10:43:24', 'ثانوي'),
(17, '27381803998', 'Tech002 ', 'Tech002', '2025-10-17 10:43:24', 'ثانوي'),
(18, '28281803723', 'tech066', 'elfar1105', '2025-10-17 10:43:24', 'ثانوي'),
(19, '27881809540', '01274737144@Eh', 'i.mohamed2404', '2025-10-17 10:43:24', 'ثانوي'),
(20, '27781807029', 'Tech00100@alforqan microsoft.com', 'F.sherif00102', '2025-10-17 10:43:24', 'ثانوي'),
(21, '26873600327', 'Alforqan @sec33', 'a.salih010114', '2025-10-17 10:43:24', 'ثانوي'),
(22, '28581807336', 'Tech23onmicrosoft.com', 'r.khafagy0105', '2025-10-17 10:43:24', 'ثانوي'),
(24, '27781803481', 'tech012@alforqanschools.onmicrosoft.com', 'f.mohamed08081', '2025-10-17 10:43:24', 'ثانوي'),
(25, '28479202046', 'tech77821704@alforqanschools.onmicrosoft.com', 'hazimfaress', '2025-10-17 10:43:24', 'ثانوي'),
(26, '28081809708', 'TECH065', 'M.MOHAMED10122', '2025-10-17 10:43:24', 'ثانوي'),
(27, '26781801879', 'Tech28@alforqanschools.onmicrosoft.com', 'm.Moustafa1908', '2025-10-17 10:43:24', 'ثانوي'),
(28, '28281810261', 'Tech031@alforqanschools.onmicrosoft.com', 'a.sallam2805', '2025-10-17 10:43:24', 'ثانوي'),
(29, '28881811156', 'tech090@alforqanschools.onmicrosoft.com', 'm.mahmoud1303', '2025-10-17 10:43:24', 'ثانوي'),
(30, '28881804808', 'tech26@alforqanschools.onmicrosoft.com', 'm.mabrouck0109', '2025-10-17 10:43:24', 'ثانوي'),
(31, '29079201381', 'tech_ahmed@alforqanschools.onmicrosoft.com', 'ahmed26', '2025-10-17 10:43:24', 'ثانوي'),
(33, 'jhjh', '', '', '2026-01-15 06:10:02', 'ثانوي'),
(49, '290788027409', '', '', '2026-01-27 05:17:00', 'اعدادي'),
(50, 'sasa', '', '', '2026-01-27 05:36:42', 'ابتدائي'),
(51, 'kjlj', '', '', '2026-01-27 05:59:42', 'ابتدائي');

-- --------------------------------------------------------

--
-- Table structure for table `administration_accounts`
--

CREATE TABLE `administration_accounts` (
  `id` int(10) UNSIGNED NOT NULL,
  `employee_id` varchar(50) NOT NULL,
  `teams_account` varchar(255) DEFAULT NULL,
  `attendance_platform` varchar(255) DEFAULT NULL,
  `username` varchar(50) DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `administration_accounts`
--

INSERT INTO `administration_accounts` (`id`, `employee_id`, `teams_account`, `attendance_platform`, `username`, `password`) VALUES
(58, '43634', '', '', NULL, NULL),
(59, '33', '', '', NULL, NULL),
(61, '678678', '', '', NULL, NULL),
(67, 'dfg', '', '', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `administration_contact_info`
--

CREATE TABLE `administration_contact_info` (
  `id` int(10) UNSIGNED NOT NULL,
  `employee_id` varchar(50) NOT NULL,
  `phone_mobile` varchar(50) DEFAULT NULL,
  `phone_home` varchar(50) DEFAULT NULL,
  `emergency_phone` varchar(50) DEFAULT NULL,
  `address_qatar` varchar(255) DEFAULT NULL,
  `address_home` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `administration_contact_info`
--

INSERT INTO `administration_contact_info` (`id`, `employee_id`, `phone_mobile`, `phone_home`, `emergency_phone`, `address_qatar`, `address_home`) VALUES
(57, '43634', '', '', '', '', ''),
(58, '33', '', '', '', '', ''),
(60, '678678', '', '', '', '', ''),
(66, 'dfg', '', '', '', '', '');

-- --------------------------------------------------------

--
-- Table structure for table `administration_personal_data`
--

CREATE TABLE `administration_personal_data` (
  `id` int(10) UNSIGNED NOT NULL,
  `employee_id` varchar(50) NOT NULL,
  `full_name` varchar(255) NOT NULL,
  `employee_number` varchar(50) DEFAULT NULL,
  `personal_id` varchar(50) DEFAULT NULL,
  `birth_date` date DEFAULT NULL,
  `nationality` varchar(100) DEFAULT NULL,
  `gender` varchar(10) DEFAULT NULL,
  `marital_status` varchar(20) DEFAULT NULL,
  `num_children` int(11) DEFAULT 0,
  `driving_license` varchar(20) DEFAULT NULL,
  `photo` varchar(255) DEFAULT NULL,
  `hire_date` date DEFAULT NULL,
  `stage` enum('ابتدائي','اعدادي','ثانوي') NOT NULL DEFAULT 'ابتدائي'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `administration_personal_data`
--

INSERT INTO `administration_personal_data` (`id`, `employee_id`, `full_name`, `employee_number`, `personal_id`, `birth_date`, `nationality`, `gender`, `marital_status`, `num_children`, `driving_license`, `photo`, `hire_date`, `stage`) VALUES
(67, '43634', 'dvsd', 's36456', '', NULL, '', NULL, 'غير متزوج', 0, 'يوجد', NULL, NULL, 'ثانوي'),
(68, '33', 'df', '33', '', NULL, '', NULL, 'غير متزوج', 0, 'يوجد', NULL, NULL, 'ثانوي'),
(69, '290788027402', 'وائل المولدي  العمري1', 'WWWWW2', '', '0000-00-00', '', '', 'غير متزوج', 0, '', '290788027402.jpg', NULL, 'ثانوي'),
(71, '678678', 'yukyuk', 'yukuyk', '', NULL, '', NULL, 'غير متزوج', 0, 'يوجد', NULL, NULL, 'ابتدائي'),
(77, 'dfg', 'grte', 'ghgre', '', '0000-00-00', '', '', 'غير متزوج', 0, 'يوجد', NULL, '2026-01-28', 'اعدادي');

-- --------------------------------------------------------

--
-- Table structure for table `administration_qualifications`
--

CREATE TABLE `administration_qualifications` (
  `id` int(10) UNSIGNED NOT NULL,
  `employee_id` varchar(50) NOT NULL,
  `experience` int(11) DEFAULT 0,
  `degree` varchar(100) DEFAULT NULL,
  `major` varchar(100) DEFAULT NULL,
  `university` varchar(100) DEFAULT NULL,
  `graduation_year` int(11) DEFAULT NULL,
  `courses` text DEFAULT NULL,
  `skills` text DEFAULT NULL,
  `year_of_assignment` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `administration_qualifications`
--

INSERT INTO `administration_qualifications` (`id`, `employee_id`, `experience`, `degree`, `major`, `university`, `graduation_year`, `courses`, `skills`, `year_of_assignment`) VALUES
(67, '43634', 0, '', '', '', NULL, '', '', NULL),
(68, '33', 0, '', '', '', NULL, '', '', NULL),
(70, '678678', 0, '', '', '', NULL, '', '', NULL),
(76, 'dfg', 0, '', '', '', 0, '', '', 0);

-- --------------------------------------------------------

--
-- Table structure for table `administration_roles`
--

CREATE TABLE `administration_roles` (
  `id` int(10) UNSIGNED NOT NULL,
  `employee_id` varchar(50) NOT NULL,
  `role` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `administration_roles`
--

INSERT INTO `administration_roles` (`id`, `employee_id`, `role`) VALUES
(56, '43634', 'نائب المدير الإداري'),
(57, '33', 'أخصائي اجتماعي'),
(58, '290788027402', 'طبيب المدرسة'),
(60, '678678', 'مدير'),
(66, 'dfg', 'سكرتير');

-- --------------------------------------------------------

--
-- Table structure for table `admins`
--

CREATE TABLE `admins` (
  `id` int(11) NOT NULL,
  `username` varchar(100) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `admins`
--

INSERT INTO `admins` (`id`, `username`, `password`) VALUES
(3, 'admin', '$2y$10$4cqa8lDycpYJtXdHBFoS0u9fVDpMOuKAhGOpVJrtuEmKOYu4JHiZ6');

-- --------------------------------------------------------

--
-- Table structure for table `admin_data`
--

CREATE TABLE `admin_data` (
  `id` int(11) NOT NULL,
  `employee_id` varchar(50) NOT NULL,
  `leave_casual` int(11) DEFAULT 0,
  `leave_sick` int(11) DEFAULT 0,
  `leave_unexcused` int(11) DEFAULT 0,
  `classes_reserve` int(11) DEFAULT 0,
  `classes_extra` int(11) DEFAULT 0,
  `classes_overload` int(11) DEFAULT 0,
  `teacher_status` varchar(50) DEFAULT NULL,
  `note_verbal` tinyint(1) DEFAULT 0,
  `note_written` tinyint(1) DEFAULT 0,
  `note_warning` tinyint(1) DEFAULT 0,
  `assets_pen` tinyint(1) DEFAULT 0,
  `assets_pc` tinyint(1) DEFAULT 0,
  `assets_phone` tinyint(1) DEFAULT 0,
  `assets_car` tinyint(1) DEFAULT 0,
  `image` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `note_discount` int(11) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `admin_data`
--

INSERT INTO `admin_data` (`id`, `employee_id`, `leave_casual`, `leave_sick`, `leave_unexcused`, `classes_reserve`, `classes_extra`, `classes_overload`, `teacher_status`, `note_verbal`, `note_written`, `note_warning`, `assets_pen`, `assets_pc`, `assets_phone`, `assets_car`, `image`, `created_at`, `note_discount`) VALUES
(1, '28681811552', 2, 0, 0, 0, 0, 0, 'نشط', 0, 0, 1, 0, 0, 0, 0, '28681811552.jpg', '2025-10-17 10:43:41', 3),
(2, '27781808312', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '27781808312.jpg', '2025-10-17 10:45:09', 0),
(3, '28081809742', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '28081809742.jpg', '2025-10-17 10:45:17', 0),
(4, '28681804063', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '28681804063.jpg', '2025-10-17 10:45:21', 0),
(5, '28140002129', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '28140002129.jpg', '2025-10-17 10:45:24', 0),
(6, '28381811890', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '28381811890.jpg', '2025-10-17 10:45:28', 0),
(7, '27581806159', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '27581806159.jpg', '2025-10-17 10:45:31', 0),
(8, '27581808296', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '27581808296.png', '2025-10-17 10:45:35', 0),
(9, '28381808054', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '28381808054.jpg', '2025-10-17 10:45:39', 0),
(10, '27781803845', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '27781803845.jpg', '2025-10-17 10:45:43', 0),
(11, '28981807289', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '28981807289.jpg', '2025-10-17 10:45:47', 0),
(12, '28081810347', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '28081810347.jpg', '2025-10-17 10:45:51', 0),
(13, '27581806160', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '27581806160.jpg', '2025-10-17 10:45:55', 0),
(14, '27781804856', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '27781804856.jpg', '2025-10-17 10:45:59', 0),
(15, '27140000444', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '27140000444.jpg', '2025-10-17 10:46:03', 0),
(16, '28379202237', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '28379202237.jpg', '2025-10-17 10:46:06', 0),
(17, '27381803998', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '27381803998.jpg', '2025-10-17 10:46:10', 0),
(18, '28281803723', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '28281803723.jpg', '2025-10-17 10:46:13', 0),
(19, '27881809540', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '27881809540.jpg', '2025-10-17 10:46:17', 0),
(20, '27781807029', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '27781807029.jpg', '2025-10-17 10:46:21', 0),
(21, '26873600327', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '26873600327.jpg', '2025-10-17 10:46:24', 0),
(22, '28581807336', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '28581807336.jpg', '2025-10-17 10:46:28', 0),
(23, '29981802397', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '29981802397.jpg', '2025-10-17 10:46:32', 0),
(24, '27781803481', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '27781803481.jpg', '2025-10-17 10:46:35', 0),
(25, '28479202046', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '28479202046.jpg', '2025-10-17 10:46:39', 0),
(26, '28081809708', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '28081809708.jpg', '2025-10-17 10:46:43', 0),
(27, '26781801879', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '26781801879.jpg', '2025-10-17 10:46:46', 0),
(28, '28281810261', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '28281810261.jpg', '2025-10-17 10:46:50', 0),
(29, '28881811156', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '28881811156.jpg', '2025-10-17 10:46:54', 0),
(30, '28881804808', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, '28881804808.jpg', '2025-10-17 10:46:57', 0),
(31, '29079201381', 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 0, 0, '29079201381.jpg', '2025-10-17 10:47:01', 0),
(32, '123', 12, 0, 0, 0, 0, -2, 'نشط', 0, 0, 0, 0, 0, 0, 0, '123.jpg', '2026-01-15 07:56:31', 1),
(33, 'gdjnth', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, 'avatar.png', '2026-01-15 07:59:43', 0),
(34, '29078802740l', 8, 8, 8, 8, 8, 8, 'نشط', 8, 8, 8, 8, 8, 8, 8, '29078802740l.jpg', '2026-01-15 08:03:02', 8),
(35, '2907880274045', 0, 0, 0, 0, 0, 0, '', 0, 0, 0, 0, 0, 0, 0, '2907880274045.jpg', '2026-01-15 11:30:29', 0),
(37, '29078802740111', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, 'avatar.png', '2026-01-15 11:41:54', 0),
(38, '29078802740333', 0, 0, 0, 0, 0, 0, NULL, 0, 0, 0, 0, 0, 0, 0, 'avatar.png', '2026-01-15 11:45:29', 0);

-- --------------------------------------------------------

--
-- Table structure for table `annual_notes`
--

CREATE TABLE `annual_notes` (
  `id` int(10) UNSIGNED NOT NULL,
  `employee_id` varchar(50) NOT NULL,
  `year` int(4) NOT NULL,
  `rating` varchar(50) DEFAULT NULL,
  `manual_note` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `annual_notes`
--

INSERT INTO `annual_notes` (`id`, `employee_id`, `year`, `rating`, `manual_note`) VALUES
(1, '28681811552', 2025, 'ممتاز', ''),
(2, '28681811552', 2024, 'ممتاز', ''),
(3, '28681811552', 2023, '', ''),
(4, '28681811552', 2022, '', ''),
(5, '28681811552', 2021, '', ''),
(6, '29079201381', 2025, 'ممتاز', '3206'),
(7, '29079201381', 2024, '', ''),
(8, '29079201381', 2023, '', ''),
(9, '29079201381', 2022, '', ''),
(10, '29079201381', 2021, '', ''),
(231, '28681811552', 2026, '', ''),
(301, '123', 2026, '', ''),
(302, '123', 2025, '', ''),
(303, '123', 2024, '', ''),
(304, '123', 2023, '', ''),
(305, '123', 2022, '', ''),
(306, '29078802740l', 2026, 'ممتاز', '88'),
(307, '29078802740l', 2025, '', ''),
(308, '29078802740l', 2024, '', ''),
(309, '29078802740l', 2023, '', ''),
(310, '29078802740l', 2022, '', ''),
(316, '2907880274045', 2026, '', ''),
(317, '2907880274045', 2025, '', ''),
(318, '2907880274045', 2024, '', ''),
(319, '2907880274045', 2023, '', ''),
(320, '2907880274045', 2022, '', '');

-- --------------------------------------------------------

--
-- Table structure for table `contact_info`
--

CREATE TABLE `contact_info` (
  `id` int(10) UNSIGNED NOT NULL,
  `employee_id` varchar(50) NOT NULL,
  `phone_mobile` varchar(50) DEFAULT NULL,
  `phone_home` varchar(50) DEFAULT NULL,
  `emergency_phone` varchar(50) DEFAULT NULL,
  `address_qatar` varchar(255) DEFAULT NULL,
  `address_home` varchar(255) DEFAULT NULL,
  `bank_account` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `contact_info`
--

INSERT INTO `contact_info` (`id`, `employee_id`, `phone_mobile`, `phone_home`, `emergency_phone`, `address_qatar`, `address_home`, `bank_account`, `created_at`) VALUES
(1, '27781808312', '70034744', '01113711575', '30422210', 'معيدز شارع ٧٧٤م ٥٤', 'مدنتي', '66665556', '2025-10-17 10:43:24'),
(2, '28681811552', '77071189', '00201124685338', '00201116276665', 'مدينة خليفه', 'محافظة الشرقيه مصر ', '135876', '2025-10-17 10:43:24'),
(3, '28081809742', '74759929', '1064772688', 'لا', 'العزيزية', 'المنيا', '2244448069001', '2025-10-17 10:43:24'),
(4, '28681804063', '70705457', '01095808159', '30605652', 'معيذر الجنوبي', 'أبوكبير - الشرقية ', 'QA93QISB000000000112243830012', '2025-10-17 10:43:24'),
(5, '28140002129', '33851562', '00962777781110', '71201622', 'الدوحه فريج كليب', 'الاردن الزرقاء', '0', '2025-10-17 10:43:24'),
(6, '28381811890', '28381811890', '30444577', '30444577', 'اللقطه الدوحه ', 'الزقازيق شرقيه', 'QA43QIIB000000003333104005001', '2025-10-17 10:43:24'),
(7, '27581806159', '70353886', '‭00 20 100 4531217‬', '70353886', 'اللقطة - الدوحة ', 'ميت العامل - أجا - الدقهلية - مصر ', '2244-056635-201', '2025-10-17 10:43:24'),
(8, '27581808296', '30308240', '00105798871', '00201064411178', 'الدوحة - غرافة الريان', 'مصر - الفيوم - مدينة الفيوم', 'QA85QIIB000000004445178774001', '2025-10-17 10:43:24'),
(9, '28381808054', '30444503', '01067626503', '30444503', '7 شارع الاتفاق بن عمران', 'دريم لاند 6 اكتوبر', 'QA35QIIB000000002222591808001', '2025-10-17 10:43:24'),
(10, '27781803845', '33332467', '/', '/', 'بن محمود ', 'الاسكندريه', '2002-412505-001', '2025-10-17 10:43:24'),
(11, '28981807289', '70179724', '0502340397', 'لا اعرف', 'الغرافة', 'المنصورة', 'QA89QIIB000000003333039802201', '2025-10-17 10:43:24'),
(12, '28081810347', '70740733', '01203935138', '70293634', 'الوكير ازدان 31', 'مدينه نصر - الحى السابع - القاهره ', 'QA73QIIB000000005556210515001', '2025-10-17 10:43:24'),
(13, '27581806160', '66964744', '00201147479938', '0020403500603', 'معيذر ', 'طنطا', '2244-041967-001', '2025-10-17 10:43:24'),
(14, '27781804856', '30992122', '00201015108505', '30112728', 'الغرافة ', 'عين شمس القاهرة ', '3333-418203-001', '2025-10-17 10:43:24'),
(15, '27140000444', '55651710', '-', '-', '-', '-', '5556-568014-002', '2025-10-17 10:43:24'),
(16, '28379202237', '66651792', '+905510042444', '30800430', 'منطقة 24 شارع 804 بناء رقم 10 الطابق 2 شقة 6', 'يشيل كنت محلة شارع الحاج بيرم بناء 42 شقة 6 /اسنيورت/اسطنبول/تركيا', '0171610199001', '2025-10-17 10:43:24'),
(17, '27381803998', '55698173', '00201005732030', '70696100', 'اللقطة الدوحة', 'اللقطة الدوحة', '55698173', '2025-10-17 10:43:24'),
(18, '28281803723', '30488551', '+2001040258904', '30446663', 'اللقطة ', 'دمياط', 'QA35QIIB000000002002418395001', '2025-10-17 10:43:24'),
(19, '27881809540', '50464122', '1274737144', '0', 'الريان - اللقطه - شارع الخيف ', 'كفر الحصه - مركز نبروه - محافظة الدقهليه - مصر ', 'QA98Q11B000000003333040437001', '2025-10-17 10:43:24'),
(20, '27781807029', '77016208', '0573422274', '00201148647579', 'الدوحة - مدينة خليفة الجنوبية - شارع عمر بن الخطاب ', 'دمياط الجديدة - مجاورة ١٣ - شارع مسجد اليسر ', '83001', '2025-10-17 10:43:24'),
(21, '26873600327', '55363110', '249907756553', '77499246', 'معيذر الشمالي ', ' ولاية الجزيرة ودمدني', '5556568626001', '2025-10-17 10:43:24'),
(22, '28581807336', '77571927', '00201017374309', 'لا يوجد', 'مدينة خليفة الجنوبية الدوحة', 'القليوبية شبين القناطر', '4442020466201', '2025-10-17 10:43:24'),
(24, '27781803481', '30701513', '00201121645957', '00201121645957', 'شارع وادي السهل-منطقة 55', 'المنيا بني مزار', 'QA59QIIB000000003333039083001', '2025-10-17 10:43:24'),
(25, '28479202046', '77821704', '33507409', '33507409', 'الريان الجديدة', 'تركيا-هاتاي-الريحانية', 'QA69QISB000000000153888240014', '2025-10-17 10:43:24'),
(26, '28081809708', '70035204', '01020189361', '01226951200', 'مدينة خليفة الجنوبية ', 'العاشر', '4442-019388001', '2025-10-17 10:43:24'),
(27, '26781801879', '55430109', '0020107017540', '55430109', 'مشيرب - الدوحة', 'الزقازيق - شرقية', '2002-409059-001', '2025-10-17 10:43:24'),
(28, '28281810261', '30318779', '00201328286644', '30318779', 'مدينة خليفة', 'قليوبية - بنها', 'QA94QIIB000000003333039062001', '2025-10-17 10:43:24'),
(29, '28881811156', '31410802', '31410802', '31410802', 'الغرافة', 'الغرافة', 'QA67QIIB000000002007165905001', '2025-10-17 10:43:24'),
(30, '28881804808', '00974 - 33284262', '01028381438', '01011069120', 'الدوحة - قطر ', 'مصر - كفر الشيخ - المندورة', '2222-156948-001', '2025-10-17 10:43:24'),
(31, '29079201381', '77150232', '905392049388', '31047414', 'خليفة الشمالية', 'الغربية', '2007-210292-222', '2025-10-17 10:43:24'),
(33, 'jhjh', '', '', '', '', '', '', '2026-01-15 06:10:02'),
(49, '290788027409', '', '', '', '', '', '', '2026-01-27 05:16:59'),
(50, 'sasa', '', '', '', '', '', '', '2026-01-27 05:36:42'),
(51, 'kjlj', '', '', '', '', '', '', '2026-01-27 05:59:42');

-- --------------------------------------------------------

--
-- Table structure for table `job_data`
--

CREATE TABLE `job_data` (
  `id` int(10) UNSIGNED NOT NULL,
  `employee_id` varchar(50) NOT NULL,
  `employee_number` varchar(50) DEFAULT NULL,
  `job_title` varchar(255) DEFAULT NULL,
  `department` varchar(255) DEFAULT NULL,
  `hire_date` date DEFAULT NULL,
  `base_salary` decimal(10,2) DEFAULT NULL,
  `allowances` decimal(10,2) DEFAULT NULL,
  `contract_type` varchar(50) DEFAULT NULL,
  `salary` decimal(10,2) DEFAULT NULL,
  `job_level` varchar(50) DEFAULT NULL,
  `sponsorship` varchar(100) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `stage` varchar(20) NOT NULL DEFAULT 'ابتدائي'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `job_data`
--

INSERT INTO `job_data` (`id`, `employee_id`, `employee_number`, `job_title`, `department`, `hire_date`, `base_salary`, `allowances`, `contract_type`, `salary`, `job_level`, `sponsorship`, `created_at`, `stage`) VALUES
(1, '27781808312', '111', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 10000.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(2, '28681811552', NULL, 'مدرس', '', '0000-00-00', 0.00, 0.00, 'دوام كامل', 9700.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(3, '28081809742', '00', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 10200.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(4, '28681804063', NULL, NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 9300.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(5, '28140002129', '0', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 7900.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(6, '28381811890', NULL, NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 7950.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(7, '27581806159', NULL, NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 9850.00, '0', 'الاعدادي', '2025-10-17 10:43:24', 'ثانوي'),
(8, '27581808296', '204598', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 8000.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(9, '28381808054', NULL, NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 10650.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(10, '27781803845', '93227', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 10000.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(11, '28981807289', '119792', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 8000.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(12, '28081810347', NULL, NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 9300.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(13, '27581806160', '152475', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 8850.00, '0', 'الاعدادي', '2025-10-17 10:43:24', 'ثانوي'),
(14, '27781804856', NULL, NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 9300.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(15, '27140000444', '90112', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 12100.00, '0', 'الاعدادي', '2025-10-17 10:43:24', 'ثانوي'),
(16, '28379202237', NULL, NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 7500.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(17, '27381803998', NULL, NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 8000.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(18, '28281803723', '93230', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 10150.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(19, '27881809540', '119788', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 8100.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(20, '27781807029', '9516', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 9.00, '0', 'الاعدادي', '2025-10-17 10:43:24', 'ثانوي'),
(21, '26873600327', '93224', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 12000.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(22, '28581807336', NULL, NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 10200.00, '0', 'الاعدادي', '2025-10-17 10:43:24', 'ثانوي'),
(24, '27781803481', '119791', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 11000.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(25, '28479202046', NULL, NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 7700.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(26, '28081809708', '105836', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 7000.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(27, '26781801879', '92155', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 10800.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(28, '28281810261', '119789', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 8000.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(29, '28881811156', NULL, NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 7050.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(30, '28881804808', NULL, NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 4800.00, '0', 'الثانوي', '2025-10-17 10:43:24', 'ثانوي'),
(31, '29079201381', NULL, NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 6700.00, '0', 'الابتدائي', '2025-10-17 10:43:24', 'ثانوي'),
(33, 'jhjh', '', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 0.00, '0', '', '2026-01-15 06:10:02', 'ثانوي'),
(49, '290788027409', '', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 0.00, '0', '', '2026-01-27 05:16:59', 'اعدادي'),
(50, 'sasa', '', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 0.00, '0', '', '2026-01-27 05:36:42', 'ابتدائي'),
(51, 'kjlj', '', NULL, NULL, NULL, NULL, NULL, 'دوام كامل', 0.00, '0', '', '2026-01-27 05:59:42', 'ابتدائي');

-- --------------------------------------------------------

--
-- Table structure for table `personal_data`
--

CREATE TABLE `personal_data` (
  `id` int(10) UNSIGNED NOT NULL,
  `employee_id` varchar(50) NOT NULL,
  `full_name` varchar(255) NOT NULL,
  `personal_id` varchar(50) DEFAULT NULL,
  `birth_date` varchar(20) DEFAULT NULL,
  `nationality` varchar(100) DEFAULT NULL,
  `gender` varchar(20) DEFAULT NULL,
  `marital_status` varchar(20) DEFAULT NULL,
  `num_children` int(11) DEFAULT 0,
  `driving_license` varchar(50) DEFAULT NULL,
  `hire_date` varchar(20) DEFAULT NULL,
  `job_title` varchar(100) DEFAULT NULL,
  `department` varchar(100) DEFAULT NULL,
  `base_salary` decimal(10,2) DEFAULT NULL,
  `allowances` decimal(10,2) DEFAULT NULL,
  `contract_type` varchar(50) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `stage` enum('ابتدائي','اعدادي','ثانوي') NOT NULL DEFAULT 'ابتدائي'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `personal_data`
--

INSERT INTO `personal_data` (`id`, `employee_id`, `full_name`, `personal_id`, `birth_date`, `nationality`, `gender`, `marital_status`, `num_children`, `driving_license`, `hire_date`, `job_title`, `department`, `base_salary`, `allowances`, `contract_type`, `created_at`, `stage`) VALUES
(1, '27781808312', 'محمود محمد ابو الفتوح ابراهيم', 'A28698890', '9/17/1977', 'مصري', 'ذكر', 'متزوج', 4, 'يوجد', '9/9/2025', 'مدرس', 'اللغة العربية', NULL, NULL, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(2, '28681811552', 'أحمد شكري  ', 'A34258396', '11/29/1986', 'مصري', 'تعليم حكومي', 'متزوج', 4, 'يوجد', '9/1/2017', 'مدرس', 'فيزياء', NULL, NULL, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(3, '28081809742', 'محمد مصطفى عبد الحميد', 'A34189371', '6/7/1980', 'مصري', 'تعليم خاص', 'متزوج', 4, 'يوجد', '10/4/2013', 'مدرس', 'الشرعية', 6700.00, 3500.00, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(4, '28681804063', 'عزت محمد عطية عثمان ', 'A34719389', '6/22/1986', 'مصري', 'تعليم حكومي', 'متزوج', 4, 'يوجد', '8/24/2025', 'مدرس', 'اللغة العربية', NULL, NULL, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(5, '28140002129', 'احمد زياد يوسف دار عواد', 'R906383', '10/22/1981', 'اردني', 'تعليم خاص', 'متزوج', 4, 'يوجد', '8/24/2024', 'مدرس', 'المهارات الحياتيه', 7900.00, 0.00, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(6, '28381811890', 'تامر عبدالغفار يوسف عمر', 'A30803157', '1/11/1983', 'مصرى', 'تعليم حكومي', 'متزوج', 3, 'يوجد', '9/16/2016', 'مدرس', 'التربة البدنية', NULL, NULL, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(7, '27581806159', 'عبدالله العوضي محمود الشرقبالي ', 'A38447721', '1/4/1975', 'مصر', 'تعليم حكومي', 'متزوج', 3, 'يوجد', '9/8/2011', 'مدرس', 'فيزياء', NULL, NULL, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(8, '27581808296', 'وليد جاد', 'U28156060', '1/1/1975', 'تركي', 'تعليم حكومي', 'متزوج', 4, 'يوجد', '9/6/2017', 'مدرس', 'اللغة العربية', 4500.00, 3500.00, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(9, '28381808054', 'وائل السيد محمد عبدالرضي الانصاري', 'A23113841', '9/27/1983', 'مصري', 'تعليم خاص', 'متزوج', 3, 'يوجد', '9/16/2012', 'مدرس', 'احياء', 4500.00, 4000.00, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(10, '27781803845', 'مصطفى محمود محمد السيد سرحان', 'A24921563', '4/8/1977', 'مصر', 'تعليم حكومي', 'متزوج', 4, 'يوجد', '9/15/2005', 'مدرس', 'الدراسات الاجتماعية', 6000.00, 4000.00, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(11, '28981807289', 'محمد عاطف محمود حواس', 'A28517139', '7/1/1989', 'مصري', 'تعليم حكومي', 'متزوج', 3, 'لا يوجد', '9/20/2014', 'مدرس', 'اللغة الإنجليزية', 4500.00, 3000.00, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(12, '28081810347', 'محمد عبدالعزيز سيد عبدالعزيز ', 'A28734625', '11/4/1980', 'مصري', 'تعليم حكومي', 'متزوج', 4, 'يوجد', '10/4/2024', 'مدرس', 'كيمياء', NULL, NULL, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(13, '27581806160', 'محمود السيد محمود الطايفه', 'A34264828', '3/16/1975', 'مصري', 'تعليم خاص', 'غير متزوج', 2, 'يوجد', '9/7/2012', 'مدرس', 'اللغة الإنجليزية', 5000.00, 3800.00, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(14, '27781804856', 'تامر الصباحي مصطفى عبده', 'A35373058', '9/18/1977', 'مصري', 'تعليم في بلد الأم', 'متزوج', 4, 'يوجد', '8/25/2024', 'مدرس', 'التربة البدنية', NULL, NULL, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(15, '27140000444', 'أنس محمد عبد الهادي عمرو ', 'U0188045', '3/31/1971', 'اردني', 'تعليم حكومي', 'متزوج', 6, 'يوجد', '11/17/1998', 'مدرس', 'الشرعية', NULL, NULL, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(16, '28379202237', 'حسني رزق', 'U31039743', '9/26/1983', 'تركي', 'تعليم خاص', 'متزوج', 3, 'يوجد', '2/10/2025', 'مدرس', 'اللغة الإنجليزية', 4500.00, 3000.00, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(17, '27381803998', 'ياسر محمد السيد عرفه عبدربه ', 'A25219959', '6/27/1973', 'مصرى ', 'تعليم حكومي', 'متزوج', 4, 'يوجد', '9/4/1996', 'مدرس', 'رياضيات', NULL, NULL, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(18, '28281803723', 'محمد صلاح وهبه الفار', 'a38554616', '5/11/1982', 'مصري', 'تعليم حكومي', 'متزوج', 5, 'يوجد', '9/11/2007', 'مدرس', 'الشرعية', NULL, NULL, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(19, '27881809540', 'إيهاب رزق عطيه محمد', 'A37909304 ', '4/24/1978', 'مصري', 'تعليم في بلد الأم', 'متزوج', 3, 'يوجد', '10/24/2014', 'مدرس', 'الشرعية', 6700.00, 1400.00, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(20, '27781807029', 'فايز محمد رفعت إسماعيل  شريف ', 'A36113253', '2/1/1977', 'مصري ', 'تعليم في بلد الأم', 'متزوج', 4, 'يوجد', '9/5/2011', 'مدرس', 'اللغة العربية', 6.00, 2000.00, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(21, '26873600327', 'انور أحمد عبيد صالح', 'P13438521', '1/1/1968', 'السودانية', 'تعليم حكومي', 'متزوج', 0, 'يوجد', '9/9/1997', 'مدرس', 'اللغة الإنجليزية', 0.00, NULL, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(22, '28581807336', 'إسلام عبدالنبي محمد خفاجي', 'A38115540', '5/1/1985', 'مصري', 'تعليم في بلد الأم', 'متزوج', 3, 'يوجد', '9/1/2012', 'مدرس', 'كيمياء', 4500.00, 5700.00, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(24, '27781803481', 'فولي رجب محمد محمد', 'A31185201', '8/8/1977', 'مصري', 'تعليم في بلد الأم', 'متزوج', 5, 'يوجد', '1/8/2013', 'مدرس', 'كيمياء', NULL, NULL, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(25, '28479202046', 'حازم محي الدين عبدالله الفارس', 'U21210219', '1/1/1984', 'تركي', 'تعليم خاص', 'متزوج', 3, 'يوجد', '8/24/2025', 'مدرس', 'احياء', NULL, NULL, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(26, '28081809708', 'محمد محمود بيومي محمد ', 'A25123033', '10/12/1980', 'مصري', 'تعليم حكومي', 'متزوج', 3, 'يوجد', '1/9/2013', 'مدرس', 'كيمياء', 6700.00, 2.00, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(27, '26781801879', 'مصطفى محمد عبدالرحمن مصطفى', 'A31091203', '8/19/1967', 'مصري', 'تعليم حكومي', 'متزوج', 3, 'يوجد', '11/3/2003', 'مدرس', 'فيزياء', 6225.00, 4400.00, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(28, '28281810261', 'عبداللاه صلاح الدين عبدالعزيز سلام', ' A29586184', '5/28/1982', 'مصرى', 'تعليم حكومي', 'متزوج', 4, 'يوجد', '9/1/2014', 'مدرس', 'اللغة الإنجليزية', 8000.00, 1600.00, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(29, '28881811156', 'محمد محمود', 'U32001412', '3/13/1988', 'Turkey', 'تعليم حكومي', 'غير متزوج', 0, 'يوجد', '8/26/2018', 'مدرس', 'رياضيات', NULL, NULL, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(30, '28881804808', 'محمد لبيب محمد مبروك', 'aA35797405', '9/1/1988', 'مصري', 'تعليم في بلد الأم', 'متزوج', 4, 'يوجد', '9/7/2012', 'مدرس', 'اللغة العربية', NULL, NULL, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(31, '29079201381', 'أحمد عبدالله يلماز', 'u34143752', '4/12/1990', 'تركي', 'تعليم في بلد الأم', 'متزوج', 0, 'يوجد', '3/1/2025', 'مدرس', 'رياضيات', NULL, NULL, NULL, '2025-10-17 10:43:24', 'ثانوي'),
(33, 'jhjh', 'jhjh', 'jhjh', '', '', 'ذكر', 'غير متزوج', 0, 'يوجد', '', '', '', 0.00, 0.00, NULL, '2026-01-15 06:10:02', ''),
(34, 'fdfdfdf', 'dfdfdfd', NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-01-15 06:42:51', ''),
(35, 'ffrfr', 'wetertgreg', NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-01-15 07:36:23', ''),
(37, 'hkuil', 'sdfreg', NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-01-15 07:37:16', ''),
(38, 'fhfyukli', 'ujklyjhmfgshbfd', NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2026-01-15 07:37:31', ''),
(62, '290788027409', 'إسلام عبدالنبي محمد خفاجي ', '', '', '', 'تعليم حكومي', 'غير متزوج', 0, 'يوجد', '', '', '', 0.00, 0.00, NULL, '2026-01-27 05:16:59', 'اعدادي'),
(63, 'sasa', 'sfs', '', '', '', 'تعليم حكومي', 'غير متزوج', 0, 'يوجد', '', '', '', 0.00, 0.00, NULL, '2026-01-27 05:36:42', 'ابتدائي'),
(64, 'kjlj', 'jljk', '', '', '', 'تعليم حكومي', 'غير متزوج', 0, 'يوجد', '', '', '', 0.00, 0.00, NULL, '2026-01-27 05:59:42', 'ابتدائي');

-- --------------------------------------------------------

--
-- Table structure for table `qualifications`
--

CREATE TABLE `qualifications` (
  `id` int(10) UNSIGNED NOT NULL,
  `employee_id` varchar(50) NOT NULL,
  `experience` int(11) DEFAULT NULL,
  `degree` varchar(100) DEFAULT NULL,
  `major` varchar(100) DEFAULT NULL,
  `university` varchar(100) DEFAULT NULL,
  `graduation_year` int(11) DEFAULT NULL,
  `courses` text DEFAULT NULL,
  `skills` text DEFAULT NULL,
  `year_of_assignment` int(11) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `qualifications`
--

INSERT INTO `qualifications` (`id`, `employee_id`, `experience`, `degree`, `major`, `university`, `graduation_year`, `courses`, `skills`, `year_of_assignment`, `created_at`) VALUES
(1, '27781808312', 17, 'بكالريوس', 'لغة عربية', 'عين شمس', 1998, NULL, NULL, NULL, '2025-10-17 10:43:24'),
(2, '28681811552', 16, 'بكالوريوس في العلوم والتربيه', 'الكمياء والطبيعه', 'جامعة الأزهر', 2008, '', '', 0, '2025-10-17 10:43:24'),
(3, '28081809742', 13, 'ليسانس', 'الشريعه', 'الأزهر الشريعه', 2003, 'كثير', 'اللغه الانجليزية', 2013, '2025-10-17 10:43:24'),
(4, '28681804063', 8, 'ليسانس آداب وتربية قسم اللغة العربية ', 'لغة عربية ', 'جامعة الأزهر الشريف ', 2008, NULL, NULL, NULL, '2025-10-17 10:43:24'),
(5, '28140002129', 12, 'ماجستير ', 'ادارة اعمال', 'جامعة ال البيت ', 2017, 'دوره المعلمين الجدد ودورة تدريب المدربين ودورات اخرى', 'يوتيوبر ', 2025, '2025-10-17 10:43:24'),
(6, '28381811890', 10, 'بكالوريوس تربيه رياضيه ', 'تربيه رياضيه', 'جامعه الزقازيق', 2004, 'دورات تابعه لمكتب التطوير والتدريب بمدارس الفرقان الثانويه ', 'مدرب ومكتشف مواهب لجميع الألعاب الرياضيه المختلفه ', 2016, '2025-10-17 10:43:24'),
(7, '27581806159', 15, 'بكالريوس العلوم والتربية', 'الفيزياء والكيمياء', 'جامعة المنصورة ', 1997, NULL, NULL, NULL, '2025-10-17 10:43:24'),
(8, '27581808296', 26, 'ليسانس دار العلوم ', 'اللغة  العربية ', 'جامعة القاهرة - كلية دار العلوم', 1996, 'الإدارة الصفية - مهارات التفكير - الذكاءات المتعددة - خصائص المرحلة السنية - الفروق الفردية.....', '.', 2017, '2025-10-17 10:43:24'),
(9, '28381808054', 18, 'بكالوريوس العلوم+الدبلوم التربوي', 'الميكروبيولوجيا الدقيقه', 'كلية العلوم جامعة الازهر + كلية التربية جامعة الازهر', 2006, 'موجوده', 'موجوده', 2007, '2025-10-17 10:43:24'),
(10, '27781803845', 20, 'ليسانس اداب وتربيه ', 'جغرافيا ', 'الاسكندريه', 1999, 'تربويه', '/', 2005, '2025-10-17 10:43:24'),
(11, '28981807289', 11, 'ليسانس اداب و تربية ', 'ليسانس اداب و تربية لغة انجليزية ', 'جامعة المنصورة', 2010, 'Toefl  دورات اللغوية العصبية.  دورات تحسين الدوافع لدي الطلاب دورات في سلوك الطلاب دورات في التفكير الناقد ', 'مهارات التعامل مع الحاسب و البرامج الحديثة ', 2014, '2025-10-17 10:43:24'),
(12, '28081810347', 12, 'بكالوريوس علوم ', 'كيمياء - علم الحيوان ', 'حلوان ', 2002, 'معايير العلوم الوطنيه الاساسيه - مايكروسوفت ', NULL, 2024, '2025-10-17 10:43:24'),
(13, '27581806160', 15, 'ليسانس اداب ', 'لغه انجليزيه', 'جامعه المنوفيه', 1998, 'كمبيوتر و لغات', NULL, 2012, '2025-10-17 10:43:24'),
(14, '27781804856', 24, 'بكالريوس تربية رياضية ', 'تدريب ', 'التربية البدنية/حلوان', 2000, NULL, NULL, NULL, '2025-10-17 10:43:24'),
(15, '27140000444', 28, 'بكالوريوس ', 'شريعة', 'الجامعة الأردنية ', 1993, NULL, NULL, 1998, '2025-10-17 10:43:24'),
(16, '28379202237', 19, 'ليسانس اللغة الانجليزية والتربية', 'لغة انجليزية', 'جامعة الزقازيق/كلية التربية النوعية', 2004, NULL, NULL, NULL, '2025-10-17 10:43:24'),
(17, '27381803998', 29, 'بكالوريوس علوم وتربية ', 'رياضيات ', 'كلية التربية جامعة الزقازيق ', 1996, NULL, NULL, 1996, '2025-10-17 10:43:24'),
(18, '28281803723', 18, 'ليسانس دعوة', 'شرعي', 'الدعوة', 2004, NULL, NULL, NULL, '2025-10-17 10:43:24'),
(19, '27881809540', 11, 'ليسانس أداب وتربيه ', 'دراسات اسلاميه', 'جامعة الأزهر - كلية التربيه ', 1999, 'icdl - ', ' كيفية التعامل مع الطلاب- الذكاء الاصطناعي ', 2014, '2025-10-17 10:43:24'),
(20, '27781807029', 0, 'بكالوريس تربية  ', 'لغة عربية ', 'جامعة المنصورة / كلية التربية بدمياط ', 1999, 'دورة المعايير ١،٢، طرق تدريس اللغة العربية ، ورشة في الفروق الفردية ، الذكاء الاصطناعي  \nالضبط السلوكي  ، الذكاء العاطفي . أهمية الدافعية ', 'الخطابة والشعر والمناظرات ', 2011, '2025-10-17 10:43:24'),
(21, '26873600327', 0, 'بكالريوس', 'لغة انجليزية', 'جامعة الخرطوم', 1992, 'دورات تربوية متنوعة ', 'الدعوة باللغة الانجليزية ', 1997, '2025-10-17 10:43:24'),
(22, '28581807336', 17, 'بكالوريوس تربية ', 'طبيعة وكيمياء', 'جامعة الأزهر ', 2006, 'دوة ICDl ودورات في التربوي', 'مهارات الكمبيوتر', 2012, '2025-10-17 10:43:24'),
(24, '27781803481', 23, 'بكالوريوس العلوم والتربية', 'قسم الكيمياء والفيزياء', 'جامعة المنيا', 1999, NULL, NULL, NULL, '2025-10-17 10:43:24'),
(25, '28479202046', 14, 'إجازة في علم الاحياء', 'حيوية كيميائية', 'حلب -سوريا', 2008, NULL, NULL, NULL, '2025-10-17 10:43:24'),
(26, '28081809708', 12, 'بك علوم وتربية ', 'كيمياء وطبيعة', 'الزقازيق', 2001, 'حاسب الي - SCIENCE', 'تخصص في البحث العلمي ', 2013, '2025-10-17 10:43:24'),
(27, '26781801879', 23, 'بكالوريوس علوم وتربية', 'فيزياء وكيمياء', 'الزقازيق', 1990, NULL, 'اجادة استخدام الكومبيوتر', 1990, '2025-10-17 10:43:24'),
(28, '28281810261', 12, 'جامعى - بكالوريس', 'لغة انجليزية', 'جامعة الزقازيق', 2004, NULL, NULL, NULL, '2025-10-17 10:43:24'),
(29, '28881811156', 14, 'بكالوريوس تربية', 'رياضيات', 'جامعة سوهاج', 2009, NULL, NULL, 2018, '2025-10-17 10:43:24'),
(30, '28881804808', 14, 'ل. آداب وتربية ', 'اللغة العربية', 'كلية التربية بجامعة كفرالشيخ', 2009, NULL, NULL, NULL, '2025-10-17 10:43:24'),
(31, '29079201381', 8, 'بكالريوس مع دبلومه', 'هندسه ', 'Near East University ', 201, NULL, NULL, NULL, '2025-10-17 10:43:24'),
(33, 'jhjh', 0, '', '', '', 0, '', '', 0, '2026-01-15 06:10:02'),
(49, '290788027409', 0, '', '', '', 0, '', '', 0, '2026-01-27 05:16:59'),
(50, 'sasa', 0, '', '', '', 0, '', '', 0, '2026-01-27 05:36:42'),
(51, 'kjlj', 0, '', '', '', 0, '', '', 0, '2026-01-27 05:59:42');

-- --------------------------------------------------------

--
-- Table structure for table `supervisors_data`
--

CREATE TABLE `supervisors_data` (
  `employee_id` varchar(50) NOT NULL,
  `full_name` varchar(255) DEFAULT NULL,
  `personal_id` varchar(50) DEFAULT NULL,
  `birth_date` date DEFAULT NULL,
  `nationality` varchar(50) DEFAULT NULL,
  `gender` varchar(50) DEFAULT NULL,
  `marital_status` varchar(50) DEFAULT NULL,
  `num_children` int(11) DEFAULT NULL,
  `driving_license` varchar(20) DEFAULT NULL,
  `job_title` varchar(100) DEFAULT NULL,
  `experience` int(11) DEFAULT NULL,
  `degree` varchar(100) DEFAULT NULL,
  `major` varchar(100) DEFAULT NULL,
  `university` varchar(100) DEFAULT NULL,
  `graduation_year` int(11) DEFAULT NULL,
  `courses` text DEFAULT NULL,
  `skills` text DEFAULT NULL,
  `year_of_assignment` int(11) DEFAULT NULL,
  `phone_mobile` varchar(20) DEFAULT NULL,
  `phone_home` varchar(20) DEFAULT NULL,
  `emergency_phone` varchar(20) DEFAULT NULL,
  `address_qatar` varchar(255) DEFAULT NULL,
  `address_home` varchar(255) DEFAULT NULL,
  `employee_number` varchar(50) DEFAULT NULL,
  `sponsorship` varchar(50) DEFAULT NULL,
  `teams_account` varchar(100) DEFAULT NULL,
  `attendance_platform` varchar(100) DEFAULT NULL,
  `photo` varchar(255) DEFAULT 'avatar.png',
  `stage` enum('ابتدائي','اعدادي','ثانوي') NOT NULL DEFAULT 'ابتدائي'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `supervisors_data`
--

INSERT INTO `supervisors_data` (`employee_id`, `full_name`, `personal_id`, `birth_date`, `nationality`, `gender`, `marital_status`, `num_children`, `driving_license`, `job_title`, `experience`, `degree`, `major`, `university`, `graduation_year`, `courses`, `skills`, `year_of_assignment`, `phone_mobile`, `phone_home`, `emergency_phone`, `address_qatar`, `address_home`, `employee_number`, `sponsorship`, `teams_account`, `attendance_platform`, `photo`, `stage`) VALUES
('29078802740', 'إسلام عبدالنبي محمد خفاجي', 'A38115540', '0000-00-00', '', 'ذكر', 'غير متزوج', 0, 'يوجد', '', 0, '', '', '', 0, '', '', 0, '', '', '', '', '', '', '', '', '', 'avatar.png', 'ثانوي'),
('290788027403', 'وائل المولدي  العمري', '', '0000-00-00', '', 'تعليم حكومي', 'غير متزوج', 0, 'يوجد', '', 0, '', '', '', 0, '', '', 0, '', '', '', '', '', '', '', '', '', 'avatar.png', 'ثانوي'),
('867867', 'yukuy', '', '0000-00-00', '', 'تعليم حكومي', 'غير متزوج', 0, 'يوجد', '', 0, '', '', '', 0, '', '', 0, '', '', '', '', '', '', '', '', '', 'avatar.png', 'ابتدائي'),
('98098', 'mnklk', '', '0000-00-00', '', 'تعليم حكومي', 'غير متزوج', 0, 'يوجد', '', 0, '', '', '', 0, '', '', 0, '', '', '', '', '', '', '', '', '', 'avatar.png', 'اعدادي'),
('s', 'ss', '', '0000-00-00', '', 'تعليم حكومي', 'غير متزوج', 0, 'يوجد', '', 0, '', '', '', 0, '', '', 0, '', '', '', '', '', '', '', '', '', 'avatar.png', 'اعدادي');

-- --------------------------------------------------------

--
-- Table structure for table `supervisor_admin`
--

CREATE TABLE `supervisor_admin` (
  `id` int(11) NOT NULL,
  `employee_id` varchar(50) DEFAULT NULL,
  `leave_casual` int(11) DEFAULT 0,
  `leave_sick` int(11) DEFAULT 0,
  `leave_unexcused` int(11) DEFAULT 0,
  `supervisor_status` varchar(100) DEFAULT '',
  `note_verbal` text DEFAULT NULL,
  `note_written` text DEFAULT NULL,
  `note_warning` text DEFAULT NULL,
  `note_discount` int(11) NOT NULL DEFAULT 0,
  `assets_pen` varchar(255) DEFAULT '',
  `assets_pc` varchar(255) DEFAULT '',
  `assets_phone` varchar(255) DEFAULT '',
  `assets_car` varchar(255) DEFAULT '',
  `image` varchar(255) DEFAULT 'avatar.png'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `supervisor_admin`
--

INSERT INTO `supervisor_admin` (`id`, `employee_id`, `leave_casual`, `leave_sick`, `leave_unexcused`, `supervisor_status`, `note_verbal`, `note_written`, `note_warning`, `note_discount`, `assets_pen`, `assets_pc`, `assets_phone`, `assets_car`, `image`) VALUES
(16, '29078802740', 1, 0, 0, '', '', '0', '', 0, '', '', '', '', 'avatar.png');

-- --------------------------------------------------------

--
-- Table structure for table `supervisor_classes`
--

CREATE TABLE `supervisor_classes` (
  `id` int(11) NOT NULL,
  `employee_id` varchar(50) DEFAULT NULL,
  `class_level` int(11) DEFAULT NULL,
  `class_number` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `supervisor_shifts_break`
--

CREATE TABLE `supervisor_shifts_break` (
  `id` int(11) NOT NULL,
  `employee_id` varchar(50) DEFAULT NULL,
  `duty` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `supervisor_shifts_morning`
--

CREATE TABLE `supervisor_shifts_morning` (
  `id` int(11) NOT NULL,
  `employee_id` varchar(50) DEFAULT NULL,
  `duty` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(255) NOT NULL,
  `role` enum('general_manager','primary','middle','secondary') NOT NULL,
  `stage` enum('ابتدائي','اعدادي','ثانوي','كامل') DEFAULT NULL,
  `can_add` tinyint(1) DEFAULT 0,
  `can_edit` tinyint(1) DEFAULT 0,
  `can_delete` tinyint(1) DEFAULT 0,
  `can_admin_data` tinyint(1) DEFAULT 0,
  `position` enum('مدير نظام','مشرف نظام') NOT NULL DEFAULT 'مشرف نظام',
  `is_stage_admin` tinyint(1) NOT NULL DEFAULT 0,
  `is_general_manager` tinyint(1) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `role`, `stage`, `can_add`, `can_edit`, `can_delete`, `can_admin_data`, `position`, `is_stage_admin`, `is_general_manager`) VALUES
(18, 'adminsec', '$2y$10$9PUqFgwtgSGjPBEMpybhXeX3K3KcEwLSu9jksjLdkzAXcJNXoo4.y', 'secondary', 'ثانوي', 1, 1, 1, 1, 'مدير نظام', 1, 0),
(34, 'primary_admin', '$2y$10$6Qnc7CE4.djmbsd3teJiQ.niASzhOHX8QOwRl6VDEYl/R5Zgu6H/q', 'primary', 'ابتدائي', 1, 1, 1, 1, 'مدير نظام', 1, 0),
(35, 'middle_admin', '$2y$10$/D2kOe1jk.vgMa7zQJ3GBeWCqnzgIrh.FD/LVAYzsrnsrYXe8NqPi', 'middle', 'اعدادي', 1, 1, 1, 1, 'مدير نظام', 1, 0),
(37, 'forqmanager', '$2y$10$oVGdTM4A/haMGMdy4gpY2O8J7EDz0waOLEN7rkqewy5vfdQGftz/K', 'general_manager', '', 1, 1, 1, 1, 'مشرف نظام', 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `workers`
--

CREATE TABLE `workers` (
  `employee_id` int(11) NOT NULL,
  `stage` enum('ابتدائي','اعدادي','ثانوي') NOT NULL DEFAULT 'ابتدائي'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `workers_data`
--

CREATE TABLE `workers_data` (
  `employee_id` varchar(50) NOT NULL,
  `full_name` varchar(255) DEFAULT NULL,
  `birth_date` date DEFAULT NULL,
  `nationality` varchar(50) DEFAULT NULL,
  `marital_status` enum('غير متزوج','متزوج') DEFAULT 'غير متزوج',
  `num_children` int(11) DEFAULT 0,
  `driving_license` varchar(10) DEFAULT 'لا يوجد',
  `job_title` varchar(100) DEFAULT NULL,
  `experience` int(11) DEFAULT 0,
  `degree` varchar(100) DEFAULT NULL,
  `major` varchar(100) DEFAULT NULL,
  `university` varchar(150) DEFAULT NULL,
  `graduation_year` int(11) DEFAULT NULL,
  `courses` text DEFAULT NULL,
  `skills` text DEFAULT NULL,
  `year_of_assignment` int(11) DEFAULT NULL,
  `phone_mobile` varchar(20) DEFAULT NULL,
  `phone_home` varchar(20) DEFAULT NULL,
  `emergency_phone` varchar(20) DEFAULT NULL,
  `address_qatar` varchar(255) DEFAULT NULL,
  `address_home` varchar(255) DEFAULT NULL,
  `employee_number` varchar(50) DEFAULT NULL,
  `sponsorship` varchar(50) DEFAULT NULL,
  `photo` varchar(255) DEFAULT 'avatar.png',
  `stage` enum('ابتدائي','اعدادي','ثانوي') NOT NULL DEFAULT 'ابتدائي',
  `role` enum('سائق','عامل','عامل وسائق','حارس') NOT NULL DEFAULT 'عامل'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `workers_data`
--

INSERT INTO `workers_data` (`employee_id`, `full_name`, `birth_date`, `nationality`, `marital_status`, `num_children`, `driving_license`, `job_title`, `experience`, `degree`, `major`, `university`, `graduation_year`, `courses`, `skills`, `year_of_assignment`, `phone_mobile`, `phone_home`, `emergency_phone`, `address_qatar`, `address_home`, `employee_number`, `sponsorship`, `photo`, `stage`, `role`) VALUES
('2907880274034565', 'وائل المولدي  العمري', NULL, '', 'غير متزوج', 0, '', '', 0, '', '', '', 0, '', '', 0, '0', '', '', '', '', '', '', 'avatar.png', 'ثانوي', 'عامل'),
('290788027403543', 'وائل المولدي  العمري1dwdwq', NULL, '', 'غير متزوج', 0, '', '', 0, '', '', '', 0, '', '', 0, '0', '', '', '', '', '', '', 'avatar.png', 'ثانوي', 'عامل'),
('2907880274056', 'إسلام عبدالنبي محمد خفاجي', '2026-01-16', '', 'غير متزوج', 0, '', '', 0, '', '', '', 0, '', '', 0, '0', '', '', '', '', '', '', 'avatar.png', 'ثانوي', 'عامل'),
('29078802740k', 'إسلام عبدالنبي محمد خفاجي d', NULL, '', 'غير متزوج', 0, '', '', 0, '', '', '', 0, '', '', 0, '0', '', '', '', '', '', '', 'avatar.png', 'ثانوي', 'عامل'),
('356465', 'إسلام عبدالنبي محمد خفاجي d', NULL, '', 'غير متزوج', 0, '', '', 0, '', '', '', 0, '', '', 0, '0', '', '', '', '', '', '', 'avatar.png', 'ثانوي', 'عامل'),
('45435', 'fdgfdg', NULL, '', 'غير متزوج', 0, '', '', 0, '', '', '', 0, '', '', 0, '0', '', '', '', '', '', '', 'avatar.png', 'ابتدائي', 'عامل'),
('456546', 'hgfghfg', NULL, '', 'غير متزوج', 0, '', '', 0, '', '', '', 0, '', '', 0, '0', '', '', '', '', '', '', 'avatar.png', '', 'عامل'),
('ccc', 'ccc', NULL, '', 'غير متزوج', 0, 'يوجد', '', 0, '', '', '', 0, '', '', 0, '0', '', '', '', '', '', '', 'avatar.png', 'اعدادي', 'عامل'),
('gjghj', 'ghjgtj', NULL, '', 'غير متزوج', 0, '', '', 0, '', '', '', 0, '', '', 0, '0', '', '', '', '', '', '', 'avatar.png', 'ثانوي', 'عامل'),
('saff', 'sfsf', NULL, '', 'غير متزوج', 0, '', '', 0, '', '', '', 0, '', '', 0, '0', '', '', '', '', '', '', 'avatar.png', '', 'عامل'),
('safsa', 'sfsf', NULL, '', 'غير متزوج', 0, '', '', 0, '', '', '', 0, '', '', 0, '0', '', '', '', '', '', '', 'avatar.png', '', 'عامل'),
('sfs', 'sds', NULL, '', 'غير متزوج', 0, '', '', 0, '', '', '', 0, '', '', 0, '0', '', '', '', '', '', '', 'avatar.png', '', 'عامل'),
('sfsa', 'sfsf', NULL, '', 'غير متزوج', 0, '', '', 0, '', '', '', 0, '', '', 0, '0', '', '', '', '', '', '', 'avatar.png', '', 'عامل');

-- --------------------------------------------------------

--
-- Table structure for table `worker_admin`
--

CREATE TABLE `worker_admin` (
  `id` int(11) NOT NULL,
  `employee_id` varchar(50) DEFAULT NULL,
  `leave_casual` int(11) DEFAULT 0,
  `leave_sick` int(11) DEFAULT 0,
  `leave_unexcused` int(11) DEFAULT 0,
  `worker_status` varchar(100) DEFAULT '',
  `note_verbal` text DEFAULT NULL,
  `note_written` text DEFAULT NULL,
  `note_warning` text DEFAULT NULL,
  `note_discount` int(11) NOT NULL DEFAULT 0,
  `assets_uniform` varchar(255) DEFAULT '',
  `assets_tools` varchar(255) DEFAULT '',
  `assets_phone` varchar(255) DEFAULT '',
  `assets_vehicle` varchar(255) DEFAULT '',
  `image` varchar(255) DEFAULT 'avatar.png'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `worker_admin_data`
--

CREATE TABLE `worker_admin_data` (
  `id` int(11) NOT NULL,
  `employee_id` varchar(50) NOT NULL,
  `buses` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT '[]' CHECK (json_valid(`buses`)),
  `tasks` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT '[]' CHECK (json_valid(`tasks`)),
  `year_ratings` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT '[]' CHECK (json_valid(`year_ratings`)),
  `cleaning_tasks` text DEFAULT NULL,
  `cleaning_places` text DEFAULT NULL,
  `presence_places` text DEFAULT NULL,
  `assets` text DEFAULT NULL,
  `leave_type` varchar(50) DEFAULT NULL,
  `supervisor_status` varchar(50) DEFAULT NULL,
  `annual_ratings` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `worker_assets`
--

CREATE TABLE `worker_assets` (
  `id` int(11) NOT NULL,
  `employee_id` varchar(20) NOT NULL,
  `asset_name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `worker_buses`
--

CREATE TABLE `worker_buses` (
  `id` int(11) NOT NULL,
  `bus_name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `worker_buses`
--

INSERT INTO `worker_buses` (`id`, `bus_name`) VALUES
(2147483647, 'باص 1');

-- --------------------------------------------------------

--
-- Table structure for table `worker_cleaning_places`
--

CREATE TABLE `worker_cleaning_places` (
  `id` int(11) NOT NULL,
  `employee_id` varchar(20) NOT NULL,
  `place_name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `worker_presence_places`
--

CREATE TABLE `worker_presence_places` (
  `id` int(11) NOT NULL,
  `employee_id` varchar(20) NOT NULL,
  `place_name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `worker_tasks`
--

CREATE TABLE `worker_tasks` (
  `id` int(11) NOT NULL,
  `employee_id` varchar(50) DEFAULT NULL,
  `task_type` varchar(100) DEFAULT '',
  `task_details` varchar(255) DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `accounts`
--
ALTER TABLE `accounts`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `employee_id` (`employee_id`);

--
-- Indexes for table `administration_accounts`
--
ALTER TABLE `administration_accounts`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `employee_id` (`employee_id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- Indexes for table `administration_contact_info`
--
ALTER TABLE `administration_contact_info`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `employee_id` (`employee_id`);

--
-- Indexes for table `administration_personal_data`
--
ALTER TABLE `administration_personal_data`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `employee_id` (`employee_id`);

--
-- Indexes for table `administration_qualifications`
--
ALTER TABLE `administration_qualifications`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `employee_id` (`employee_id`);

--
-- Indexes for table `administration_roles`
--
ALTER TABLE `administration_roles`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `employee_id` (`employee_id`);

--
-- Indexes for table `admins`
--
ALTER TABLE `admins`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- Indexes for table `admin_data`
--
ALTER TABLE `admin_data`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `employee_id` (`employee_id`);

--
-- Indexes for table `annual_notes`
--
ALTER TABLE `annual_notes`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `employee_year_unique` (`employee_id`,`year`);

--
-- Indexes for table `contact_info`
--
ALTER TABLE `contact_info`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `job_data`
--
ALTER TABLE `job_data`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `personal_data`
--
ALTER TABLE `personal_data`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `qualifications`
--
ALTER TABLE `qualifications`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `supervisors_data`
--
ALTER TABLE `supervisors_data`
  ADD PRIMARY KEY (`employee_id`);

--
-- Indexes for table `supervisor_admin`
--
ALTER TABLE `supervisor_admin`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `employee_id` (`employee_id`);

--
-- Indexes for table `supervisor_classes`
--
ALTER TABLE `supervisor_classes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `employee_id` (`employee_id`);

--
-- Indexes for table `supervisor_shifts_break`
--
ALTER TABLE `supervisor_shifts_break`
  ADD PRIMARY KEY (`id`),
  ADD KEY `employee_id` (`employee_id`);

--
-- Indexes for table `supervisor_shifts_morning`
--
ALTER TABLE `supervisor_shifts_morning`
  ADD PRIMARY KEY (`id`),
  ADD KEY `employee_id` (`employee_id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- Indexes for table `workers`
--
ALTER TABLE `workers`
  ADD PRIMARY KEY (`employee_id`);

--
-- Indexes for table `workers_data`
--
ALTER TABLE `workers_data`
  ADD PRIMARY KEY (`employee_id`);

--
-- Indexes for table `worker_admin`
--
ALTER TABLE `worker_admin`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `employee_id` (`employee_id`);

--
-- Indexes for table `worker_admin_data`
--
ALTER TABLE `worker_admin_data`
  ADD PRIMARY KEY (`id`),
  ADD KEY `employee_id` (`employee_id`);

--
-- Indexes for table `worker_assets`
--
ALTER TABLE `worker_assets`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `worker_buses`
--
ALTER TABLE `worker_buses`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `worker_cleaning_places`
--
ALTER TABLE `worker_cleaning_places`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `worker_presence_places`
--
ALTER TABLE `worker_presence_places`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `worker_tasks`
--
ALTER TABLE `worker_tasks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `employee_id` (`employee_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `accounts`
--
ALTER TABLE `accounts`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;

--
-- AUTO_INCREMENT for table `administration_accounts`
--
ALTER TABLE `administration_accounts`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=68;

--
-- AUTO_INCREMENT for table `administration_contact_info`
--
ALTER TABLE `administration_contact_info`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=67;

--
-- AUTO_INCREMENT for table `administration_personal_data`
--
ALTER TABLE `administration_personal_data`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=78;

--
-- AUTO_INCREMENT for table `administration_qualifications`
--
ALTER TABLE `administration_qualifications`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=77;

--
-- AUTO_INCREMENT for table `administration_roles`
--
ALTER TABLE `administration_roles`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=67;

--
-- AUTO_INCREMENT for table `admins`
--
ALTER TABLE `admins`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `admin_data`
--
ALTER TABLE `admin_data`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=40;

--
-- AUTO_INCREMENT for table `annual_notes`
--
ALTER TABLE `annual_notes`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=336;

--
-- AUTO_INCREMENT for table `contact_info`
--
ALTER TABLE `contact_info`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;

--
-- AUTO_INCREMENT for table `job_data`
--
ALTER TABLE `job_data`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;

--
-- AUTO_INCREMENT for table `personal_data`
--
ALTER TABLE `personal_data`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=65;

--
-- AUTO_INCREMENT for table `qualifications`
--
ALTER TABLE `qualifications`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=52;

--
-- AUTO_INCREMENT for table `supervisor_admin`
--
ALTER TABLE `supervisor_admin`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `supervisor_classes`
--
ALTER TABLE `supervisor_classes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=226;

--
-- AUTO_INCREMENT for table `supervisor_shifts_break`
--
ALTER TABLE `supervisor_shifts_break`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;

--
-- AUTO_INCREMENT for table `supervisor_shifts_morning`
--
ALTER TABLE `supervisor_shifts_morning`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=74;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;

--
-- AUTO_INCREMENT for table `workers`
--
ALTER TABLE `workers`
  MODIFY `employee_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `worker_admin`
--
ALTER TABLE `worker_admin`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `worker_admin_data`
--
ALTER TABLE `worker_admin_data`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `worker_assets`
--
ALTER TABLE `worker_assets`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `worker_buses`
--
ALTER TABLE `worker_buses`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2147483648;

--
-- AUTO_INCREMENT for table `worker_cleaning_places`
--
ALTER TABLE `worker_cleaning_places`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `worker_presence_places`
--
ALTER TABLE `worker_presence_places`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `worker_tasks`
--
ALTER TABLE `worker_tasks`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `supervisor_admin`
--
ALTER TABLE `supervisor_admin`
  ADD CONSTRAINT `supervisor_admin_ibfk_1` FOREIGN KEY (`employee_id`) REFERENCES `supervisors_data` (`employee_id`) ON DELETE CASCADE;

--
-- Constraints for table `supervisor_classes`
--
ALTER TABLE `supervisor_classes`
  ADD CONSTRAINT `supervisor_classes_ibfk_1` FOREIGN KEY (`employee_id`) REFERENCES `supervisors_data` (`employee_id`) ON DELETE CASCADE;

--
-- Constraints for table `supervisor_shifts_break`
--
ALTER TABLE `supervisor_shifts_break`
  ADD CONSTRAINT `supervisor_shifts_break_ibfk_1` FOREIGN KEY (`employee_id`) REFERENCES `supervisors_data` (`employee_id`) ON DELETE CASCADE;

--
-- Constraints for table `supervisor_shifts_morning`
--
ALTER TABLE `supervisor_shifts_morning`
  ADD CONSTRAINT `supervisor_shifts_morning_ibfk_1` FOREIGN KEY (`employee_id`) REFERENCES `supervisors_data` (`employee_id`) ON DELETE CASCADE;

--
-- Constraints for table `worker_admin`
--
ALTER TABLE `worker_admin`
  ADD CONSTRAINT `worker_admin_ibfk_1` FOREIGN KEY (`employee_id`) REFERENCES `workers_data` (`employee_id`) ON DELETE CASCADE;

--
-- Constraints for table `worker_admin_data`
--
ALTER TABLE `worker_admin_data`
  ADD CONSTRAINT `worker_admin_data_ibfk_1` FOREIGN KEY (`employee_id`) REFERENCES `workers_data` (`employee_id`) ON DELETE CASCADE;

--
-- Constraints for table `worker_tasks`
--
ALTER TABLE `worker_tasks`
  ADD CONSTRAINT `worker_tasks_ibfk_1` FOREIGN KEY (`employee_id`) REFERENCES `workers_data` (`employee_id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
